nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot.c
/*
 * Bit index for the above integer
 */
static uint32_t s_tx_failure_ota_index = 0;

/*
 * Boolean to track whether antenna switching is enabled or not
 */
static bool s_prevent_antenna_switch = false;

#endif // BUILD_FEATURE_ANTENNA_DIVERSITY

/**
 * This function ensures that only one task is calling nlradio API.
 * nlradio is not thread-safe and requires this check.
 */
static void check_single_task(void)
{
#ifdef NLRADIO_DEBUG
    /* Start tracking the task, which uses nlradio API */
    if (s_task == NULL)
    {
        s_task = xTaskGetCurrentTaskHandle();
    }

    assert(s_task == xTaskGetCurrentTaskHandle());
#endif /* DEBUG */
}

/**
 * Intialize the rx packet pool
 *
 * @note
 *    This function should only be called
 *    when RX interrupts are disabled.
 */
static void nlradio_rx_packet_init(void)
{
    s_rx_packet_list_head = s_rx_packet_list_tail = NULL;

    for (size_t i = 0; i < NLRADIO_NUM_RX_BUFFERS; i++)
    {
        s_rx_packet_pool[i].in_use = false;
    }
}

/**
 * Allocate a rx packet from the rx packet pool
 *
 * @note
 *    This functions is called from the RX ISR.
 *    So, this alloc function will always
 *    operate atomically with respect to the
 *    free function.
 *
 * @param[out] all_used    A pointer to a boolean variable.
 *     The value will be set to indicate whether all rx
 *     packets are in-use (after allocating the rx packet).
 *     This could be used to decide whether to disable
 *     auto-ack.
 *
 * @retval pointer to a rx packet if one is available
 * @retval NULL if a rx packet is unavailable
 */
static nlradio_packet_t *nlradio_rx_packet_alloc_isr(bool *all_used)
{
    nlradio_packet_t *p = NULL;

    *all_used = true;

    for (size_t i = 0; i < NLRADIO_NUM_RX_BUFFERS; i++)
    {
        if (!p)
        {
            if (!s_rx_packet_pool[i].in_use)
            {
                s_rx_packet_pool[i].in_use = true;
                s_rx_packet_pool[i].next = NULL;
                p = &s_rx_packet_pool[i];
            }
        }
        else
        {
            /* After allocating a rx packet (`p` being non-NULL), check
             * if we can still find another free buffer from the pool.
             * If we can, set `all_used` to false and return.
             */

            if (!s_rx_packet_pool[i].in_use)
            {
                *all_used = false;
                break;
            }
        }
    }

    return p;
}

/**
 * Free a rx packet to the rx packet pool
 *
 * @note
 *    This functions is called from the nlradio API.
 *
 * @param[in] buffer  a pointer to the psdu member of a rx packet
 *
 * @retval true if packet was freed
 * @retval false if packet was not freed
 */
static bool nlradio_rx_packet_free(uint8_t *buffer)
{
    bool result = false;

    for (size_t i = 0; i < NLRADIO_NUM_RX_BUFFERS; i++)
    {
        if (buffer == s_rx_packet_pool[i].psdu)
        {
            /* As the rx packet buffer is being freed (`in_use` set to
             * `false`) the auto-ack should be enabled (in case it
             * was disabled from the receive ISR earlier). These two
             * operations should be done atomically to ensure that the
             * freed buffer cannot be claimed by the rx ISR callback
             * before we get the chance to enable the auto-ack. So
             * they are protected by disabling/enabling interrupts.
             */

            nrf_drv_radio802154_critical_section_enter();

            s_rx_packet_pool[i].next = NULL;
            s_rx_packet_pool[i].in_use = false;

            if (!nrf_drv_radio802154_auto_ack_get())
            {
                nrf_drv_radio802154_auto_ack_set(true);
            }

            nrf_drv_radio802154_critical_section_exit();

            result = true;
            break;
        }
    }

    return result;
}

/**
 * Enqueue a rx packet to the received packet list.
 *
 * @note
 *    This functions is called from the RX ISR.
 *    So, it operates atomically with respect to
 *    the dequeue function.  If this function is
 *    not called from inside of the RX ISR there
 *    could potentially be a race condition with
 *    respect to the management of the list head
 *    and tail pointers.
 *
 * @param[in] packet  a pointer to a rx packet
 */
static void nlradio_rx_packet_list_enqueue_isr(nlradio_packet_t *packet)
{
    packet->next = NULL;

    if (s_rx_packet_list_tail == NULL)
    {
        s_rx_packet_list_tail = s_rx_packet_list_head = packet;
    }
    else
    {
        s_rx_packet_list_tail->next = (volatile struct nl_radio_packet_s *)packet;
        s_rx_packet_list_tail = packet;
    }
}

/**
 * Dequeue a rx packet from the received packet list.
 *
 * @note
 *    This functions is called from the nlradio API
 *    So, the RX interrupt must be disabled
 *    when managing the list head and tail pointers.
 *
 * @param[in] packet  a pointer to a rx packet
 *
 * @retval pointer to a rx packet if one is available
 * @retval NULL if a rx packet is unavailable
 */
static nlradio_packet_t *nlradio_rx_packet_list_dequeue(void)
{
    nlradio_packet_t *p = NULL;

    if (s_rx_packet_list_head != NULL)
    {
        p = (nlradio_packet_t *)s_rx_packet_list_head;

        nrf_drv_radio802154_critical_section_enter();

        s_rx_packet_list_head = (nlradio_packet_t *)(p->next);
        if (s_rx_packet_list_head == NULL)
        {
            s_rx_packet_list_tail = NULL;
        }

        nrf_drv_radio802154_critical_section_exit();

        p->next = NULL;
    }

    return p;
}

/**
 * Acquire the mcu sleep lock
 *
 * @note
 *    This function acquires a lock
 *    that prevents the mcu
 *    from attempting to sleep when
 *    there is otherwise no mcu
 *    processing to be done
 */
static void nlradio_acquire_mcu_sleep_lock(void)
{
    if (!s_sleep_blocked)
    {
        nlplatform_block_sleep(true);
        s_sleep_blocked = true;
    }
}

/**
 * Release the mcu sleep lock
 *
 * @note
 *    This function releases a lock
 *    that prevents the mcu
 *    from attempting to sleep when
 *    there is otherwise no mcu
 *    processing to be done
 */
static void nlradio_release_mcu_sleep_lock(void)
{
    if (s_sleep_blocked)
    {
        nlplatform_block_sleep(false);
        s_sleep_blocked = false;
    }
}

/**
 * Initialize the nlradio driver
 *
 * @note
 *    This function is called from nlradio_enable()
 *    and nlradio_disable().  In both cases nlradio
 *    state, nrf radio state, and the radio hardware
 *    state should be left in the same condition.
 *    That is radio reset with power on, channel 11,
 *    default tx power, auto ack enabled, and nrf
 *    radio driver state and hardware state should
 *    be sleep as defined by the radio state
 *    diagram in OT platform radio.h.
 */
static void nlradio_init_internal(void)
{
    // reset the radio
    nrf_radio_power_set(false);
    nrf_radio_power_set(true);

    s_channel = 11;

    nrf_drv_radio802154_channel_set(s_channel);

    nrf_drv_radio802154_tx_power_set(s_default_tx_power);

    nrf_drv_radio802154_auto_ack_set(true);

    nlradio_sleep_internal();

    nlradio_rx_packet_init();

    nltimer_stop(NLTIMER_RADIO);

    s_rx_callback = NULL;
    s_tx_complete_callback = NULL;
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
    s_tx_start_callback = NULL;
#endif
    s_escan_callback = NULL;
}

/**
 * Sleep the nlradio driver
 *
 * @note
 *    This function stops all radio activity.
 *    It stops any ack timeout timer, disables
 *    the FEM, puts the nrf radio driver and hardware
 *    in sleep mode and then releases the nlplatform
 *    sleep lock.
 */
static void nlradio_sleep_internal(void)
{
    uint16_t msTick = NLRADIO_SLEEP_WAIT_MS;

    nltimer_stop(NLTIMER_RADIO);

    // Call sleep until we get success indicating that we are on the way to sleep
    while (!nrf_drv_radio802154_sleep() && --msTick)
    {
        nlplatform_delay_ms(1);
    }

    // Wait for the state transition to actually happen indicating that the radio is asleep
    while ((nrf_drv_radio802154_fsm_state_get() != RADIO_STATE_SLEEP) && msTick--)
    {
        nlplatform_delay_ms(1);
    }

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    nlproduct_FEM_disable();
#endif

    nlradio_release_mcu_sleep_lock();
#if defined(BUILD_FEATURE_NL_PROFILE)
    nl_profile_stop(NL_PROFILE_RADIO_ENABLED);
#endif
}

/**
 * Wake the nlradio driver
 *
 * @note
 *    This function prepares the radio for operation
 *    by acquiring the nlplatform sleep lock and
 *    enabling the FEM.
 */
static void nlradio_wakeup_internal(void)
{
#if defined(BUILD_FEATURE_NL_PROFILE)
    nl_profile_start(NL_PROFILE_RADIO_ENABLED);
#endif
    nlradio_acquire_mcu_sleep_lock();

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    nlproduct_FEM_enable();
#endif
}

/**
 * Convert format of short address
 *
 * @note
 *    This function converts a uint16_t src
 *    to a 2 byte uint8_t array with the lsb
 *    byte of the uint16_t stored in the first
 *    byte of the array and the msb of the uint16_t
 *    stored in the second byte of the array.
 *
 * @param[in]  src  a uint16_t byte short address
 * @param[out] dest a pointer to a 2 byte Uint8_t array
 *
 */
static inline void nlradio_convert_short_address(uint8_t *dest, uint16_t src)
{
    dest[0] = (uint8_t) src;
    dest[1] = (uint8_t)(src >> 8);
}

/**
 * Set the tx power
 *
 * @param[in] power The encoded TX power
 *
 */
static void nlradio_set_tx_power_internal(int8_t power)
{
    int8_t radio_tx_power;

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    // when there is a FEM, the power value shouldn't be used directly
    // but must be parsed by the product FEM library, which will
    // return to us the TXPOWER register setting to use and also
    // configure the FEM accordingly when the TX is enabled next.
    radio_tx_power = nlproduct_FEM_configure_transmit_power((nlencoded_transmit_power_t)power);
#else   // !BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM
    radio_tx_power = power;
#endif  // BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

    nrf_drv_radio802154_tx_power_set(radio_tx_power);
}

/**
 * Called when TX is complete with success or failure
 * @param[in]  nlradio_tx_error_t  TX success or failure
 *
 */
static void nlradio_tx_done(nlradio_tx_error_t tx_error)
{
#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
        if (!s_prevent_antenna_switch)
        {
            // Antenna switch logic
            if (tx_error == k_nlradio_tx_error_no_ack)
            {
                // Set bit in case of error over the air
                s_tx_failure_ota |= (1UL << s_tx_failure_ota_index);
            }
            else if (tx_error == k_nlradio_tx_error_none)
            {
                // Clear bit in case of tx success
                s_tx_failure_ota &= ~(1UL << s_tx_failure_ota_index);
            }

