nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot.c
            s_tx_failure_ota_index++;

            // Reset index when we reach the max number of bytes.
            // Start filling out from the beginning without erasing the rest
            // of the bytes to keep history.
            if (s_tx_failure_ota_index == NL_RADIO_NUM_BITS)
            {
                s_tx_failure_ota_index = 0;
            }

            // If we see more than 50% of the transmits fail, then switch antenna
            if (__builtin_popcount(s_tx_failure_ota) > NL_RADIO_FAILURE_THRESH)
            {
                // Switch antenna
                nlproduct_select_next_antenna();

                s_tx_failure_ota = 0;
                s_tx_failure_ota_index = 0;
            }
        }
#endif // BUILD_FEATURE_ANTENNA_DIVERSITY
}

/**
 * Mechanism to prevent/allow antenna switching
 *
 * @param[in]  prevent_switching     Indicates whether antenna switching should be on or off
 *
 */
#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
void nlradio_set_prevent_antenna_switch(bool prevent_switching)
{
    if (prevent_switching)
    {
        s_tx_failure_ota = 0;
        s_tx_failure_ota_index = 0;
    }

    s_prevent_antenna_switch = prevent_switching;
}
#endif // BUILD_FEATURE_ANTENNA_DIVERSITY

/**
 * Tx ACK timeout handler.
 *
 * @note
 *    If this handler is called then we did not receive an expected ACK to
 *    a transmitted packet.
 *
 */
static int nlradio_tx_ack_timeout_handler(nltimer_id_t timer_id, void *context)
{
    transmit_complete_cb callback;

    (void)timer_id;
    (void)context;

    nltimer_stop(NLTIMER_RADIO);

    // only make the callback if we are still in the transmit state
    // if we are not in the transmit state then we must have received
    // a transmit complete interrupt as the timer was timing out
    if (s_radio_state == k_nlradio_state_transmit)
    {
        // return the radio state back to receive
        s_radio_state = k_nlradio_state_receive;

        // return the radio tx power to the default tx power used for acks
        nlradio_set_tx_power_internal(s_default_tx_power);

        // return the radio driver state back to receive
        nrf_drv_radio802154_receive();

        callback = s_tx_complete_callback;
        s_tx_complete_callback = NULL;

        if (callback)
        {
            const bool frame_pending = false;
            const bool from_isr = true;

            nlradio_tx_done(k_nlradio_tx_error_no_ack);
            callback(k_nlradio_tx_error_no_ack, frame_pending, kRadioRssiUnknown, 0, from_isr);
        }
    }

    return 1;   // run scheduler after ISR
}

/**
 * Check if ACK is requested in given frame.
 *
 * @param[in]  p_frame  Pointer to a frame to check.
 *
 * @retval  true   ACK is requested in given frame.
 * @retval  false  ACK is not requested in given frame.
 */
static inline bool nlradio_ack_is_requested(const uint8_t *p_frame)
{
    return (p_frame[ACK_REQUEST_OFFSET] & ACK_REQUEST_BIT) ? true : false;
}

/**
 * Get the nest factory-assigned IEEE EUI-64 for this interface.
 *
 * @param[out] eui64_addr  A pointer to where the nest factory-assigned IEEE EUI-64 will be placed.
 *
 * @retval true   If the Extended Address get operation succeeded.
 * @retval false  If the Extended Address get operation failed.
 */
static bool nlradio_get_nest_ieee_eui64(uint8_t *eui64_addr)
{
    bool retval = false;
    char value[24]; // "xx:xx:xx:xx:xx:xx:xx:xx";
    size_t value_length = sizeof(value) / sizeof(value[0]);

    nlREQUIRE(nl_sysenv_get_string(k802154AddrKey, value, value_length) >= 0, done);

    nlREQUIRE(nl_getCharSeparatedBytes(value, eui64_addr, EXTENDED_ADDRESS_SIZE, ':', 16) == EXTENDED_ADDRESS_SIZE, done);

    retval = true;

done:
    return retval;
}

/**
 ****************
 * NL Radio API *
 ****************
 */

/**
 * Intialize the radio.
 *
 * @param[in] inContext           A pointer to a nlradio specific context
 *                                provided by nlradio client.
 *
 * @retval k_nlradio_error_none   If radio driver initialization succeeded.
 * @retval k_nlradio_error_fail   If radio driver initialization failed.
 */
int nlradio_init(void *inContext)
{
    check_single_task();

    nrf_drv_radio802154_init();

    nltimer_request(NLTIMER_RADIO);

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    // encoded value set in nlproduct_config.h
    s_default_tx_power = NLRADIO_DEFAULT_ACK_TX_POWER;
#else   // !BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM
    s_default_tx_power = NLRADIO_MAX_RADIO_TX_POWER;
#endif  // BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM


    return k_nlradio_error_none;
}

/**
 * Initialize and enable the radio, then transition to sleep state.
 *
 * @retval k_nlradio_error_none   If radio driver transitioned to sleep.
 * @retval k_nlradio_error_fail   If radio driver initialization failed.
 */
int nlradio_enable(void)
{
    int retval = k_nlradio_error_fail;

    check_single_task();

    if (s_radio_state == k_nlradio_state_disabled)
    {
        nlradio_init_internal();

        s_radio_state = k_nlradio_state_sleep;

        retval = k_nlradio_error_none;
    }

    return retval;
}

/**
 * Disable radio and transition to disabled.
 *
 * @retval k_nlradio_error_none   If transitioned to disabled state.
 * @retval k_nlradio_error_fail   If failed to disable radio.
 */
int nlradio_disable(void)
{
    int retval = k_nlradio_error_fail;

    check_single_task();

    if (s_radio_state == k_nlradio_state_sleep)
    {
        nlradio_init_internal();

        s_radio_state = k_nlradio_state_disabled;

        retval = k_nlradio_error_none;
    }

    return retval;
}

/**
 * Get the current state of the radio driver.
 *
 * @retval The current radio driver state, one of nlradio_state_t.
 */
nlradio_state_t nlradio_get_state(void)
{
    check_single_task();

    return s_radio_state;
}

/**
 * Set the PAN ID for address filtering.
 *
 * @param[in] pan_id  The IEEE 802.15.4 PAN ID.
 *
 * @retval k_nlradio_error_none  If the PAN ID set operation succeeded.
 * @retval k_nlradio_error_fail  If the PAN ID set operation failed.
 */
int nlradio_set_pan_id(uint16_t pan_id)
{
    receive_complete_cb callback;
    uint8_t id[PAN_ID_SIZE];

