nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot.c
                // nlradio can have one and only one single threaded client
                // so at this point the only way s_radio_state is not k_nlradio_state_transmit
                // is if the tx complete interrupt fired after the call to nrf_drv_radio802154_transmit_raw()
                // and before this check of s_radio_state.
                // If the tx complete interrupt fired before we called nltimer_start()
                // then we need to cancel the timer here since the tx complete isr which
                // normally would have cancelled the timer fired before the timer was started.
                // If the tx complete interrupt fired after we returned from nltimer_start()
                // then the timer will have already been cancelled normally inside of the
                // tx complete isr but there is no harm in canceling it again here
                if (s_radio_state != k_nlradio_state_transmit)
                {
                    nltimer_stop(NLTIMER_RADIO);
                }
            }

            retval = k_nlradio_error_none; // indicate success to the caller.
        }
    }

    return retval;
}

/**
 * Transition the radio to receive and execute the callback when complete.
 *
 * @note
 *    A successful return indicates that the radio driver has transitioned
 *    into the k_nlradio_state_receive state. The radio will remain in this state
 *    until the receive operation completes upon which it will execute the callback
 *    (cb).  The callback is executed by the ISR and must therefore be
 *    ISR safe.
 *
 * @param[in] channel       The radio channel upon which the receive operation shall occur.
 * @param[in] cb            A callback that will be called when the receive completes.
 *
 * @retval k_nlradio_error_none  If the reception was started successfully and the radio transitioned to the k_nlradio_state_receive.
 * @retval k_nlradio_error_fail  If the reception failed to start.
 */
int nlradio_receive(uint8_t channel, receive_complete_cb cb)
{
    int retval = k_nlradio_error_fail;

    check_single_task();

    if (s_radio_state == k_nlradio_state_sleep || // configure the radio for receive.
        (s_radio_state == k_nlradio_state_receive && (channel != s_channel || cb != s_rx_callback))) // change the receive channel or callback
    {
        if (s_radio_state == k_nlradio_state_sleep)
        {
            nlradio_wakeup_internal();
        }

        // setting the current callback to NULL
        // to ignore Rx packets
        s_rx_callback = NULL;

        // change the radio state to indicate that it is now in the receive state.
        s_radio_state = k_nlradio_state_receive;

        s_channel = channel;

        nrf_drv_radio802154_channel_set(s_channel);
        nlradio_set_tx_power_internal(s_default_tx_power);
        nrf_drv_radio802154_receive();

        s_rx_callback = cb;

        retval = k_nlradio_error_none; // indicate success back to the caller.
    }
    else if (s_radio_state == k_nlradio_state_receive)
    {
        retval = k_nlradio_error_none; // indicate success back to the caller.
    }

    return retval;
}

/**
 * Read radio RSSI.
 *
 * @note
 *    RSSI should be read when there are no detectable ongoing
 *    15.4 packet transmissions.
 *
 * @param[out] rssi                A pointer to hold the RSSI value.
 *
 * @retval k_nlradio_error_none    Successfully read RSSI.
 * @retval k_nlradio_error_fail    Radio was busy, could not read RSSI.
 */
int nlradio_get_rssi(int8_t *rssi)
{
    check_single_task();

    *rssi = nrf_drv_radio802154_rssi_last_get();

    return k_nlradio_error_none;
}

/**
 * Called to perform post-processing of a previously received frame.
 *
 * @note
 *    The caller is expected to call this API only after having been notified
 *    by execution of the receive_complete_cb that was passed into nlradio_receive().
 *
 * @param[out] buffer        A buffer pointer to hold the received frame on completion.
 * @param[out] num_bytes     The number of bytes used in buffer to store the RX frame.
 * @param[out] channel       The channel the radio was on when it received the frame.
 * @param[out] power         The signal strength (RSSI) of the received frame.
 * @param[out] lqi           The link quality indicator for the received frame.
 * @param[out] timestamp     The time since boot when the radio began to receive the frame (rx sfd), in microseconds.
 *
 * @retval k_nlradio_error_none  If the driver specific operation completed successfully.
 * @retval k_nlradio_error_fail  If the driver specific operation failed.
 */
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
int nlradio_post_process_receive(uint8_t **buffer, uint32_t *num_bytes, uint8_t *channel, int8_t *power, uint8_t *lqi, uint64_t *timestamp)
#else
int nlradio_post_process_receive(uint8_t **buffer, uint32_t *num_bytes, uint8_t *channel, int8_t *power, uint8_t *lqi)
#endif
{
    int retval = k_nlradio_error_fail;
    nlradio_packet_t *p;

    check_single_task();

    if (buffer != NULL && num_bytes != NULL)
    {
        if ((p = nlradio_rx_packet_list_dequeue()) != NULL)
        {
            *buffer = p->psdu;
            *num_bytes = p->length;
            *channel = p->channel;
            *power = p->power;
            *lqi = p->lqi;
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
            *timestamp = p->timestamp;
#endif

            retval = k_nlradio_error_none;
        }
    }

    return retval;
}

/**
 * Called to free a buffer received in nlradio_post_process_receive.
 *
 * @note
 *    The caller is expected to call this API when it is ready to free a buffer it
 *    acquired from nlradio_post_process_receive.
 *
 * @param[in] buffer        A buffer to be freed.
 *
 * @retval k_nlradio_error_none  If the driver specific operation completed successfully.
 * @retval k_nlradio_error_fail  If the driver specific operation failed.
 */
int nlradio_buffer_free(uint8_t *buffer)
{
    int retval = k_nlradio_rx_error_none;

    check_single_task();

    if (!nlradio_rx_packet_free(buffer))
    {
        retval = k_nlradio_error_fail;
    }

    return retval;
}

/**
 * Returns the capabilities of the radio.
 *
 * @retval A bitfield consisting of zero or more nlradio_capabilities_t values.
 */
nlradio_capabilities_t nlradio_get_capabilities(void)
{
    check_single_task();

