nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot.c
    // use OT energy scan for now so don't include k_nlradio_capability_energy_scan
    return k_nlradio_capability_ack_timeout;
}

/**
 * Override source address matching and set frame pending
 * for all short and extended address data polls.
 *
 * @param[in] enable    true, to set frame pending for all acks
 *                      false, to use the frame pending source address match tables
 *                             to determine whether to set frame pending in ack
 *
 * @retval k_nlradio_error_none  If the override source match operation succeeded.
 * @retval k_nlradio_error_fail  If the override source match operation failed.
 */
int nlradio_override_source_match(bool enable)
{
    check_single_task();

    nrf_drv_radio802154_auto_pending_bit_set(enable);

    return k_nlradio_error_none;
}

/**
 * Clear all Extended Address source match entries.
 *
 * @retval k_nlradio_error_none  If the clear all extended address match operation succeeded.
 * @retval k_nlradio_error_fail  If the clear all extended address match operation failed.
 */
int nlradio_clear_extended_source_match_address_entries(void)
{
    const bool address_is_extended = true;

    check_single_task();

    nrf_drv_radio802154_pending_bit_for_addr_reset(address_is_extended);

    return k_nlradio_error_none;
}

/**
 * Set/Clear the Extended Address source match entry.
 *
 * @param[in] extended_address  A pointer of 8 bytes containing the IEEE 802.15.4 Extended Address.
 * @param[in] pending           true, to add this extended address to the source match table,
 *                              false, to remove this extended address from the source match table
 *
 * @retval k_nlradio_error_none  If the set extended address match operation succeeded.
 * @retval k_nlradio_error_fail  If the address could not be added to the table when pending == true
 *                               or if the address was not found when pending == false
 */
int nlradio_set_extended_source_match_address_entry(const uint8_t *extended_address, bool pending)
{
    int retval = k_nlradio_error_fail;
    const bool address_is_extended = true;

    check_single_task();

    if (pending)
    {
        if (nrf_drv_radio802154_pending_bit_for_addr_set(extended_address, address_is_extended))
        {
            retval = k_nlradio_error_none;
        }
    }
    else
    {
        if (nrf_drv_radio802154_pending_bit_for_addr_clear(extended_address, address_is_extended))
        {
            retval = k_nlradio_error_none;
        }
    }

    return retval;
}

/**
 * Clear all Short Address source match entries.
 *
 * @retval k_nlradio_error_none  If the clear all short address match operation succeeded.
 * @retval k_nlradio_error_fail  If the clear all short address match operation failed.
 */
int nlradio_clear_short_source_match_address_entries(void)
{
    const bool address_is_extended = false;

    check_single_task();

    nrf_drv_radio802154_pending_bit_for_addr_reset(address_is_extended);

    return k_nlradio_error_none;
}

/**
 * Set/Clear the Short Address source match entry.
 *
 * @param[in] short_address  The IEEE 802.15.4 Short Address.
 * @param[in] pending           true, to add this short address to the source match table,
 *                              false, to remove this short address from the source match table
 *
 * @retval k_nlradio_error_none  If the set short address match operation succeeded.
 * @retval k_nlradio_error_fail  If the address could not be added to the table when pending == true
 *                               or if the address was not found when pending == false
 */
int nlradio_set_short_source_match_address_entry(uint16_t short_address, bool pending)
{
    int retval = k_nlradio_error_fail;
    uint8_t address[SHORT_ADDRESS_SIZE];
    const bool address_is_extended = false;

    check_single_task();

    nlradio_convert_short_address(address, short_address);

    if (pending)
    {
        if (nrf_drv_radio802154_pending_bit_for_addr_set(address, address_is_extended))
        {
            retval = k_nlradio_error_none;
        }
    }
    else
    {
        if (nrf_drv_radio802154_pending_bit_for_addr_clear(address, address_is_extended))
        {
            retval = k_nlradio_error_none;
        }
    }

    return retval;
}

/**
 * Get the radio filter mode.
 *
 * @retval The current filter mode.
 */
nlradio_filter_mode_t nlradio_get_filter_mode(void)
{
    nlradio_filter_mode_t filter_mode = k_nlradio_filter_mode_normal;

    check_single_task();

    if (nrf_drv_radio802154_promiscuous_get())
    {
        filter_mode = k_nlradio_filter_mode_full_promiscuous;
    }

    return filter_mode;
}

/**
 * Set the radio filter mode to either normal (destination address filtering),
 * promiscuous (all to a given panid), or monitor mode (all on given channel).
 *
 * @param[in] filter_mode       The radio filter mode.
 *
 * @retval k_nlradio_error_none  If the set filter mode operation succeeded.
 * @retval k_nlradio_error_fail  If the given filter mode could not be set.
 */
int nlradio_set_filter_mode(nlradio_filter_mode_t filter_mode)
{
    bool enable;

    check_single_task();

    switch(filter_mode)
    {
        case k_nlradio_filter_mode_network_promiscuous:
        case k_nlradio_filter_mode_full_promiscuous:
            enable = true;
            break;

        case k_nlradio_filter_mode_normal:
        default:
            enable = false;
            break;
    }

    nrf_drv_radio802154_promiscuous_set(enable);

    return k_nlradio_error_none;
}

/**
 * Initiate an energy scan on the specified channel for the specified duration.
 *
 * @param[in] channel       The radio channel upon which the energy scan operation shall occur.
 * @param[in] duration_msec The duration in milliseconds for the energy scan.
 * @param[in] cb            A callback that will be called when the energy scan completes.
 *
 * @retval k_nlradio_error_none  If the start energy scan operation succeeded.
 * @retval k_nlradio_error_fail  If the start energy scan operation failed.
 */
int nlradio_start_energy_scan(uint8_t channel, uint32_t duration_msec, escan_complete_cb cb)
{
    int retval = k_nlradio_error_fail;

