nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot.c
    check_single_task();

    if (s_radio_state == k_nlradio_state_sleep || s_radio_state == k_nlradio_state_receive)
    {
        uint16_t msTick = NLRADIO_ESCAN_WAIT_MS;

        if (s_radio_state == k_nlradio_state_sleep)
        {
            nlradio_wakeup_internal();
        }

        s_pre_escan_radio_state = s_radio_state;

        s_escan_callback = cb;

        s_radio_state = k_nlradio_state_energy_scan;

        nrf_drv_radio802154_channel_set(channel);

        while (!nrf_drv_radio802154_energy_detection(duration_msec) && msTick--)
        {
            nlplatform_delay_ms(1);
        }

        if (msTick)
        {
            retval = k_nlradio_error_none;
        }
        else
        {
            s_radio_state = s_pre_escan_radio_state;
        }
    }

    return retval;
}

/**
 * Get the factory-assigned IEEE EUI-64 for this interface.
 *
 * @param[in]  aInstance             The OpenThread instance structure.
 * @param[out] aIeeeEui64            A pointer to where the factory-assigned IEEE EUI-64 will be placed.
 *
 * @retval k_nlradio_error_none  If the Extended Address set operation succeeded.
 * @retval k_nlradio_error_fail  If the Extended Address set operation failed.
 */
int nlradio_get_ieee_eui64(uint8_t *aIeeeEui64)
{
    check_single_task();

    if (!nlradio_get_nest_ieee_eui64(aIeeeEui64))
    {
        uint64_t factoryAddress = (uint64_t)NRF_FICR->DEVICEID[0] << 32;

        factoryAddress |=  NRF_FICR->DEVICEID[1];

        memcpy(aIeeeEui64, &factoryAddress, sizeof(factoryAddress));
    }

    return k_nlradio_error_none;
}

/**
 * Get radio receive sensitivity.
 *
 * @retval The radio receive sensitivity value in dBm.
 */
int nlradio_get_rx_sensitivity(void)
{
    check_single_task();

    return NLRADIO_RECEIVE_SENSITIVITY;
}


/**
 ***************************************************
 * Nordic Radio Driver ISR Handler function calls. *
 ***************************************************
 */

/**
 * Notify that frame was received.
 *
 * @note Buffer pointed by the p_data pointer is not modified by the radio driver (and can't
 *       be used to receive a frame) until nrf_drv_radio802154_buffer_free_raw() function is called.
 * @note Buffer pointed by the p_data pointer may be modified by the function handler (and other
 *       modules) until nrf_drv_radio802154_buffer_free_raw() function is called.
 * @note The next higher layer should handle nrf_drv_radio802154_received_raw() or
 *       nrf_drv_radio802154_received() function. It should not handle both.
 *
 * p_data
 * v
 * +-----+-----------------------------------------------------------+------------+
 * | PHR | MAC Header and payload                                    | FCS        |
 * +-----+-----------------------------------------------------------+------------+
 *       |                                                                        |
 *       | <---------------------------- PHR -----------------------------------> |
 *
 * @param[in]  p_data  Pointer to the buffer containing received data (PHR + PSDU). First byte in
 *                     the buffer is length of the frame (PHR) and following bytes is the frame
 *                     itself (PSDU). Length byte (PHR) includes FCS. FCS is already verified by
 *                     the hardware and may be modified by the hardware.
 * @param[in]  power   RSSI of received frame.
 * @param[in]  lqi     LQI of received frame.
 */
void nrf_drv_radio802154_received_raw(uint8_t *p_data, int8_t power, int8_t lqi)
{
    if (s_radio_state == k_nlradio_state_receive || s_radio_state == k_nlradio_state_transmit)
    {
        if (s_rx_callback != NULL)
        {
            nlradio_rx_error_t rx_error = k_nlradio_rx_error_no_buffer;
            bool all_buffers_used;
            nlradio_packet_t *p;
            const bool from_isr = true;

            if ((p = nlradio_rx_packet_alloc_isr(&all_buffers_used)) != NULL)
            {
                if (all_buffers_used)
                {
                    /* If there is no more rx buffer in the pool, disable the
                     * auto-ack so that radio does not ack any future
                     * received frame.
                     */

                    nrf_drv_radio802154_auto_ack_set(false);
                }

                rx_error = k_nlradio_rx_error_none;

                p->length = p_data[0];
                p->power = power;
                p->lqi = lqi;
                memcpy(p->psdu, &p_data[1], p->length);
                p->channel = nrf_drv_radio802154_channel_get();
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
                uint64_t ota_time = (PHR_SIZE + p->length) * PHY_SYMBOLS_PER_OCTET * PHY_US_PER_SYMBOL;
                p->timestamp = nltime_get_system_us() - ota_time;
#endif
                nlradio_rx_packet_list_enqueue_isr(p);
            }

            s_rx_callback(rx_error, from_isr);
        }
    }

    nrf_drv_radio802154_buffer_free_raw(p_data);
}

/**
 * Notify that reception of a frame failed.
 *
 * @param[in]  error  An error code that indicates reason of the failure.
 */
void nrf_drv_radio802154_receive_failed(nrf_drv_radio802154_rx_error_t error)
{
    switch (error)
    {
        case NRF_DRV_RADIO802154_RX_ERROR_INVALID_FRAME:
        case NRF_DRV_RADIO802154_RX_ERROR_INVALID_FCS:
        case NRF_DRV_RADIO802154_RX_ERROR_INVALID_DEST_ADDR:
        case NRF_DRV_RADIO802154_RX_ERROR_RUNTIME:
        case NRF_DRV_RADIO802154_RX_ERROR_TIMESLOT_ENDED:
        default:
            // TBD - determine which of these errors should be reported to nlopenthread
            // s_rx_callback(k_nlradio_rx_error_cancelled, true);
            break;
    }
}

/**
 * Notify that frame was transmitted.
 *
 * @note If ACK was requested for transmitted frame this function is called after proper ACK is
 *       received. If ACK was not requested this function is called just after transmission is
 *       ended.
 * @note Buffer pointed by the p_ack pointer is not modified by the radio driver (and can't
 *       be used to receive a frame) until nrf_drv_radio802154_buffer_free_raw() function is
 *       called.
 * @note Buffer pointed by the p_ack pointer may be modified by the function handler (and other
 *       modules) until nrf_drv_radio802154_buffer_free_raw() function is called.
 * @note The next higher layer should handle nrf_drv_radio802154_transmitted_raw() or
 *       nrf_drv_radio802154_transmitted() function. It should not handle both.
 *
 * @param[in]  p_ack  Pointer to received ACK buffer. Fist byte in the buffer is length of the
 *                    frame (PHR) and following bytes are the ACK frame itself (PSDU). Length byte
 *                    (PHR) includes FCS. FCS is already verified by the hardware and may be
 *                    modified by the hardware.
 *                    If ACK was not requested p_ack is set to NULL.
 * @param[in]  power  RSSI of received frame or 0 if ACK was not requested.
 * @param[in]  lqi    LQI of received frame or 0 if ACK was not requested.
 */
void nrf_drv_radio802154_transmitted_raw(uint8_t *p_ack, int8_t power, int8_t lqi)
{
    transmit_complete_cb callback;

    // stop the ACK timeout
    nltimer_stop(NLTIMER_RADIO);

    // return the radio state back to receive
    s_radio_state = k_nlradio_state_receive;

    // return the radio tx power to the default tx power used for acks
    nlradio_set_tx_power_internal(s_default_tx_power);

    callback = s_tx_complete_callback;
    s_tx_complete_callback = NULL;

    if (callback)
    {
        bool frame_pending;
        const bool from_isr = true;

