nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot.c
        if (p_ack == NULL)
        {
            frame_pending = false;
        }
        else
        {
            frame_pending = (p_ack[FRAME_PENDING_OFFSET] & FRAME_PENDING_BIT) ? true : false;
        }

        nlradio_tx_done(k_nlradio_tx_error_none);
        callback(k_nlradio_tx_error_none, frame_pending, power, lqi, from_isr);
    }

    if (p_ack != NULL)
    {
        nrf_drv_radio802154_buffer_free_raw(p_ack);
    }
}

/**
 * Notify that frame was not transmitted due to busy channel.
 *
 * This function is called if transmission procedure fails.
 *
 * @param[in]  error  Reason of the failure.
 */
void nrf_drv_radio802154_transmit_failed(nrf_drv_radio802154_tx_error_t error)
{
    transmit_complete_cb callback;

    // stop the ACK timeout
    nltimer_stop(NLTIMER_RADIO);

    // return the radio state back to receive
    s_radio_state = k_nlradio_state_receive;

    // return the radio tx power to the default tx power used for acks
    nlradio_set_tx_power_internal(s_default_tx_power);

    callback = s_tx_complete_callback;
    s_tx_complete_callback = NULL;

    if (callback)
    {
        nlradio_tx_error_t tx_error;
        const bool frame_pending = false;
        const bool from_isr = true;

        switch (error)
        {
            case NRF_DRV_RADIO802154_TX_ERROR_BUSY_CHANNEL:
            case NRF_DRV_RADIO802154_TX_ERROR_TIMESLOT_ENDED:
                tx_error = k_nlradio_tx_error_channel_busy;
                break;

            case NRF_DRV_RADIO802154_TX_ERROR_INVALID_ACK:
                tx_error = k_nlradio_tx_error_no_ack;
                break;

            case NRF_DRV_RADIO802154_TX_ERROR_NO_MEM:
            default:
                tx_error = k_nlradio_tx_error_platform;
                break;
        }

        nlradio_tx_done(tx_error);
        callback(tx_error, frame_pending, kRadioRssiUnknown, 0, from_isr);
    }
}

/**
 * Notify that Energy Detection procedure finished.
 *
 * @note This function passes EnergyLevel defined in 802.15.4-2006 specification:
 *       0x00 - 0xff proportional to detected energy level (dBm above receiver sensitivity). To
 *       calculate result in dBm use nrf_drv_radio802154_dbm_from_energy_level_calculate().
 *
 * @param[in]  result  Maximum energy detected during Energy Detection procedure.
 */
void nrf_drv_radio802154_energy_detected(uint8_t result)
{
    if (s_radio_state == k_nlradio_state_energy_scan)
    {
        if (s_pre_escan_radio_state == k_nlradio_state_receive)
        {
            receive_complete_cb cb = s_rx_callback;

            s_rx_callback = NULL;

            s_radio_state = k_nlradio_state_receive;

            nrf_drv_radio802154_channel_set(s_channel);
            nlradio_set_tx_power_internal(s_default_tx_power);
            nrf_drv_radio802154_receive();

            s_rx_callback = cb;
        }
        else
        {
            nlradio_sleep_internal();

            s_radio_state = k_nlradio_state_sleep;
        }

        if (s_escan_callback)
        {
            const bool from_isr = true;

            s_escan_callback(nrf_drv_radio802154_dbm_from_energy_level_calculate(result), from_isr);
        }
    }
}

#ifdef BUILD_FEATURE_RADIO_HEADER_IE
/**
 * @brief Notify that transmitting frame has started.
 *
 * @note It is possible that transmit procedure is interrupted and
 *       @sa nrf_drv_radio802154_transmitted won't be called.
 * @note This function should be very short to prevent dropping frames by the driver.
 */
void nrf_drv_radio802154_tx_started()
{
    if (s_tx_start_callback)
    {
        const bool from_isr = true;

        s_tx_start_callback(s_tx_packet.psdu, from_isr);
        s_tx_start_callback = NULL;
    }
}
#endif

/**
 * Radio ISR
 *
 * Prototype is included here because this is an ISR handler and there is a symbol replacement
 * done by the linker (Radio_IRQHandler= nlradio_isr) so the prototype for nlradio_isr does not
 * exist elsewhere. The compiler will warn of a missing prototype otherwise which will be
 * interpreted as an error for our builds.
 */
void nlradio_isr(void);
void nlradio_isr(void)
{
    nrf_drv_radio802154_irq_handler();
}


/**
 *****************************************
 * Noric OT Radio Driver FEM Control API *
 *****************************************
 */

/**
 * Set PA & LNA GPIO toggle configuration.
 *
 * @note This function shall not be called when radio is in use.
 *
 * @param[in] p_cfg A pointer to the PA & LNA GPIO toggle configuration.
 *
 */
void nrf_fem_control_cfg_set(const nrf_fem_control_cfg_t *p_cfg)
{
    // this function is intentionally left as a stub
    // as this driver will configure the FEM outside
    // of the nordic ot radio driver

    (void)p_cfg;
}

/**
 * Get PA & LNA GPIO toggle configuration.
 *
 * @param[out] p_cfg A pointer to the structure for the PA & LNA GPIO toggle configuration.
 *
 */
void nrf_fem_control_cfg_get(nrf_fem_control_cfg_t *p_cfg)
{
    // this function is intentionally left as a stub
    // as this driver will configure the FEM outside
    // of the nordic ot radio driver

    (void)p_cfg;
}

/**
 * Activate FEM controller.
 *
 * This function should be called when radio wakes up.
 */
void nrf_fem_control_activate(void)
{
    // this function is intentionally left as a stub
    // as this driver will activate the FEM outside
    // of the nordic ot radio driver
}

/**
 * De-activate FEM controller.
 *
 * This function should be called when radio goes to sleep.
 */
void nrf_fem_control_deactivate(void)
{
    // this function is intentionally left as a stub
    // as this driver will deactivate the FEM outside
    // of the nordic ot radio driver
}

/**
 * Latch current time in FEM controller.
 *
 * This function stores current time to enable precise time measurement and mitigate impact of code
 * execution time. It should be called before triggering RXEN or TXEN task, and calling
 * nrf_fem_control_pa_set or nrf_fem_control_lna_set funcitons.
 */
void nrf_fem_control_time_latch(void)
{
    // this function is intentionally left as a stub
    // as this driver does not use timer instigated
    // control of the FEM
}

/**
 * Activate Power Amplifier (TX) pin of the Front End Module.
 *
 * @param[in] shorts_used Information if this operation is related to a task triggered by a short.
 *
 * This function will set up a timer to activate the pin 5 +/- 2.5 us before radio READY event is generated.
 * It will also set up a PPI to deactivate the pin on radio DISABLED event.
 *
 * @note This function shall always be called after nrf_fem_control_time_latch function was called,
 *       to enable precise time measurement.
 * */
void nrf_fem_control_pa_set(bool shorts_used)
{
    (void)shorts_used;

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    nlproduct_FEM_set_tx();
#endif
}

/**
 * Activate Low Noise Amplifier (RX) pin of the Front End Module.
 *
 * @param[in] shorts_used Information if this operation is related to a task triggered by a short.
 *
 * This function will set up a timer to activate the pin 5 +/- 2.5 us before radio READY event is generated.
 * It will also set up a PPI to deactivate the pin on radio DISABLED event.
 *
 * @note This function shall always be called after nrf_fem_control_time_latch function was called,
 *       to enable precise time measurement.
 * */
void nrf_fem_control_lna_set(bool shorts_used)
{
    (void)shorts_used;

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    nlproduct_FEM_set_rx();
#endif
}

/**
 * API to get the wpan antenna stats.
 * @param[in] pointer to a location to hold the stats counter.
 *
 * @retval k_nlradio_error_none   If antenna diversity is supported for the product
 * @retval k_nlradio_error_fail   If antenna diversity is not supported for the product
 */
int nlradio_get_wpan_antenna_stats(nlradio_wpan_antenna_stats_t *wpan_antenna_stats)
{
    (void)wpan_antenna_stats;

    return k_nlradio_error_fail;
}